---
kind: property
id: P:Autodesk.Revit.DB.CameraInfo.FarDistance
source: html/16edd64f-ac8d-23aa-dfc7-514e4bebcd13.htm
---
# Autodesk.Revit.DB.CameraInfo.FarDistance Property

Distance from eye point to far plane of view frustum along the view direction.

## Syntax (C#)
```csharp
public double FarDistance { get; }
```

## Remarks
This property together with NearDistance determines the depth restrictions of a view frustum.